rottenpotatoes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.create!(movie_params)
---
INSERT INTO "movies" ("title", "rating", "director", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "New_Movie"], ["rating", "R"], ["director", "Bill"], ["created_at", "2018-10-30 18:41:29.696634"], ["updated_at", "2018-10-30 18:41:29.696634"]]

  def show_movies_director
    id = params[:id]
    movie = Movie.find(id)
    if movie && !movie.director.nil? && !movie.director.empty?
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 1]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = ?  [["director", "George Lucas"]]